Repository: MultipleSclerosisMonitoring/DPC_2024
Catalog: locales/*/LC_MESSAGES/msGait.po
Languages: es

source: ARG_TIT_FIND_GAIT
es: Parametros para la aplicaicón msGait.

source: ARG_STR_PATH_YAML
es: Trayectoria al fichero de configuración CONFIG.YAML.

source: ARG_STR_LNG
es: Idioma: [en|es]

source: ARG-STR-FOUT-XLSX
es: Camino al Fichero excel para almacenar los datos extraidos.

source: ARG_VB_LEVEL
es: Nivel de Verbosidad [0:Nada|1:Básico|2:Detallado]

source: PRCS_LIST_ACT_ALL_IDS
es: Lista de IDs para la tabla activity_all de PostgreSQL.

source: FGAIT_PGSQL_ERR
es: Error al obtener ventanas de actividad: {e}

source: FGAIT_NO_WINS
es: No se encontraron ventanas de actividad.

source: FGAIT_1ST
es: Detectando marchas efectivas...

source: FGAIT_NO_WALK
es: No se detectó marcha efectiva en este rango.

source: FGAIT_NUM_WALKS
es: Marchas efectivas guardadas: {ns}.

source: FGAIT_END
es: Proceso finalizado correctamente.

source: Find msCodeIDs and store activity windows into PostgreSQL.
es: Buscar msCodeIDs y almacenar ventanas de actividad en PostgreSQL.

source: Start datetime (format: 'YYYY-MM-DD HH:MM:SS').
es: Fecha de comienzo (formato: 'YYYY-MM-DD HH:MM:SS').

source: End datetime (format: 'YYYY-MM-DD HH:MM:SS').
es: Fecha de finalización (formato: 'YYYY-MM-DD HH:MM:SS').

source: Path to the configuration file (config.yaml).
es: Camino al fichero de configuración (config.yaml).

source: Verbosity level (0=Silent, 1=Basic, 2=Detailed).
es: Nivel de Verbosidad (0=Silencio, 1=Básico, 2=Detallado).

source: Creating/verifying necessary tables...
es: Creando/verificando tablas necesarias ...

source: Tables verified and created if necessary.
es: Tablas verificadas y creadas si es preciso.

source: Error: End date ({end}) is before start date ({start}).
es: Error: Fecha Fin ({end}) es anterior a la Fecha de Comienzo ({start}).

source: Getting msCodeIDs from {start} to {end}...
es: Obteniendo msCodeIDs desde {start} hasta {end}...

source: No CodeIDs found.
es: CodeIDs no encontrados.

source: Found {n} different CodeIDs from {start} to {end}.
es: Encontrados {n} CodeIDs difernetes desde {start} hasta {end}.

source: Processing data for CodeID: {codeid}...
es: Procesando datos para CodeID: {codeid}...

source: CodeID {codeid} stored with ID {id}.
es: CodeID {codeid} almacenado con ID {id}.

source: Error storing CodeID {codeid}: {error}
es: Error almacenando CodeID {codeid}: {error}

source: Error fetching data for CodeID {codeid}: {error}
es: Error recuperando datos para CodeID {codeid}: {error}

source: No data found for CodeID: {codeid}.
es: Datos no encontrados para CodeID: {codeid}.

source: Foot field not found in sensor data for CodeID: {codeid}. Dataset size: {size}
es: Campo Pie no encontrado en los datos del sensor CodeID: {codeid}. Tamaño de datos: {size}

source: No activity segments identified for CodeID: {codeid}, foot: Left.
es: No se han identificado segmentos de actividad para CodeID: {codeid}, pie: Izdo.

source: No activity segments identified for CodeID: {codeid}, foot: Right.
es: No se han identificado segmentos de actividad para CodeID: {codeid}, pie: Decho.

source: Activity segments processed and stored ({n} rows):
es: Segmentos de actividad procesados y alamcenados ({n} filas):

source: Final merged segments stored ({n} rows):
es: Segmentos integrados y almacenados ({n} filas):

source: Error processing activity segments for CodeID {codeid}: {error}
es: Error procesando segmentos de actividad para CodeID {codeid}: {error}

source: All CodeIDs processed successfully.
es: Todos los CodeIDs han sido procesados satisfactoriamente.

source: PGSQL-CONN-ERR
es: Error al conectar con PostgreSQL: {e}

source: PGSQL-TAB-ERR
es: Error al verificar/crear tablas: {e}

source: INFL-QRY-COD-ERR
es: Error al obtener CodeIDs de InfluxDB: {e}

source: PGSQL-QRY-GEN-ERR
es: Error al ejecutar la consulta SQL: {e}

source: VB_REG_ACT_ALL
es: Procesando registro {row} de activity_all.

source: VB-ACT-ALL-LEGS
es: {ns} registros producidos para los pies.

source: PGSQL-VAL-COD-ERR
es: Error de validación al almacenar CodeID: {e}

source: PGSQL-INS-COD-ERR
es: Error al almacenar CodeID: {e}

source: PGSQL-INS-TAB-NOD-ERR
es: No hay datos para guardar en {table_name}.

source: PGSQL-INS-TAB-INFO
es: Guardando datos en la tabla {table_name}...

source: PGSQL-INS-TAB-OK
es: Datos guardados correctamente en la tabla {table_name}.

source: PGSQL-VAL-TAB-ERR
es: Error de validación en {table_name}: {e}

source: PGSQL-INS-TAB-ERR
es: Error al guardar los datos en {table_name}: {e}

source: PGSQL-QRY-COD-ERR
es: Error al obtener el verdadero CodeID: {e}

source: INFL-QRY-DATA-ERR
es: Error al obtener CodeIDs de InfluxDB: {e}

source: MVDET-AG-NODAT
es: Faltan datos necesarios para calcular |a| y |g|.

source: MVNT-ROOT-MISS
es: Falta la columna 'foot' en activity_windows.

source: MVNT-TS-NOV
es: Ignorando TimeStamps inválidos: {row}

source: MVNT-QRY-DAT
es: Procesando registros con CodeID: {cid} Desde: {frm}. Duración:{dur}.

source: MVNT-XLSX-DAT
es: Procesando excel hoja:{shn} en {file}.

source: MVNT-QRY-REC
es: Número de registros recuperados: {ns}

source: MVNT-WLK-FOOT
es: Marcha detectada: ID={codeid_id}, Foot={foot}, Duracion={dur}

source: MVNT-VAL-EFF-ERR
es: Error de validación en detect_effective_movement: {e}

source: MVDET-ACT-I
es: Procesando registros con CodeID: {cid} Desde: {frm}. Duración:{dur}.

source: ARG_STR_TIME_FROM
es: Fecha y hora de inicio de la ventana (YYYY-MM-DD HH:MM:SS)

source: ARG_STR_TIME_UNTIL
es: Fecha y hora de fin de la ventana (YYYY-MM-DD HH:MM:SS)

source: ERR_MUST_SPECIFY_IDS_OR_TIME_WINDOW
es: Debe especificar bien la lista de IDs (-i) o la ventana de tiempo (-f y -u).

source: PRCS_TIME_WINDOW
es: Procesando ventana desde {f} hasta {u}...

source: ERR_QUERY_ACTIVITY_ALL
es: Error al consultar activity_all: {e}

source: ARG_HEAD_ROWS
es: Número de filas a mostrar en nivel de verbosidad 2
